leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxGtm_reg.h
/** \brief  338, CMU External Clock Control Denominator Register */
#define GTM_CMU_ECLK1_DEN /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN*)0xF0100338u)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_DEN.
* To use register names with standard convension, please use GTM_CMU_ECLK1_DEN.
*/
#define	GTM_CMU_ECLK_1_DEN	(GTM_CMU_ECLK1_DEN)

/** \brief  334, CMU External Clock Control Numerator Register */
#define GTM_CMU_ECLK1_NUM /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM*)0xF0100334u)

/** Alias (User Manual Name) for GTM_CMU_ECLK1_NUM.
* To use register names with standard convension, please use GTM_CMU_ECLK1_NUM.
*/
#define	GTM_CMU_ECLK_1_NUM	(GTM_CMU_ECLK1_NUM)

/** \brief  340, CMU External Clock Control Denominator Register */
#define GTM_CMU_ECLK2_DEN /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN*)0xF0100340u)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_DEN.
* To use register names with standard convension, please use GTM_CMU_ECLK2_DEN.
*/
#define	GTM_CMU_ECLK_2_DEN	(GTM_CMU_ECLK2_DEN)

/** \brief  33C, CMU External Clock Control Numerator Register */
#define GTM_CMU_ECLK2_NUM /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM*)0xF010033Cu)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_NUM.
* To use register names with standard convension, please use GTM_CMU_ECLK2_NUM.
*/
#define	GTM_CMU_ECLK_2_NUM	(GTM_CMU_ECLK2_NUM)

/** \brief  344, CMU FXCLK Control Register */
#define GTM_CMU_FXCLK_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_FXCLK_CTRL*)0xF0100344u)

/** \brief  308, CMU Global Clock Control Denominator Register */
#define GTM_CMU_GCLK_DEN /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_DEN*)0xF0100308u)

/** \brief  304, CMU Global Clock Control Numerator Register */
#define GTM_CMU_GCLK_NUM /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_NUM*)0xF0100304u)

/** \brief  8, GTM Global Control Register */
#define GTM_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_CTRL*)0xF0100008u)

/** \brief  13044, DTM Channel Control1 Register */
#define GTM_DTM1_CH_CTRL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL1*)0xF0113044u)

/** \brief  13048, DTM Channel Control2 Register */
#define GTM_DTM1_CH_CTRL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL2*)0xF0113048u)

/** \brief  1304C, DTM Channel Control2 Shadow Register */
#define GTM_DTM1_CH_CTRL2_SR /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL2_SR*)0xF011304Cu)

/** \brief  13040, DTM Control Register */
#define GTM_DTM1_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CTRL*)0xF0113040u)

/** \brief  13054, DTM Channel Dead Time Value Register */
#define GTM_DTM1_DTV_CH0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113054u)

/** Alias (User Manual Name) for GTM_DTM1_DTV_CH0.
* To use register names with standard convension, please use GTM_DTM1_DTV_CH0.
*/
#define	GTM_DTM1_CH0_DTV	(GTM_DTM1_DTV_CH0)

/** \brief  13058, DTM Channel Dead Time Value Register */
#define GTM_DTM1_DTV_CH1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113058u)

/** Alias (User Manual Name) for GTM_DTM1_DTV_CH1.
* To use register names with standard convension, please use GTM_DTM1_DTV_CH1.
*/
#define	GTM_DTM1_CH1_DTV	(GTM_DTM1_DTV_CH1)

/** \brief  1305C, DTM Channel Dead Time Value Register */
#define GTM_DTM1_DTV_CH2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF011305Cu)

/** Alias (User Manual Name) for GTM_DTM1_DTV_CH2.
* To use register names with standard convension, please use GTM_DTM1_DTV_CH2.
*/
#define	GTM_DTM1_CH2_DTV	(GTM_DTM1_DTV_CH2)

/** \brief  13060, DTM Channel Dead Time Value Register */
#define GTM_DTM1_DTV_CH3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113060u)

/** Alias (User Manual Name) for GTM_DTM1_DTV_CH3.
* To use register names with standard convension, please use GTM_DTM1_DTV_CH3.
*/
#define	GTM_DTM1_CH3_DTV	(GTM_DTM1_DTV_CH3)

/** \brief  13050, DTM Phase Shift Control Register */
#define GTM_DTM1_PS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_PS_CTRL*)0xF0113050u)

/** \brief  13144, DTM Channel Control1 Register */
#define GTM_DTM5_CH_CTRL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL1*)0xF0113144u)

/** \brief  13148, DTM Channel Control2 Register */
#define GTM_DTM5_CH_CTRL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL2*)0xF0113148u)

/** \brief  1314C, DTM Channel Control2 Shadow Register */
#define GTM_DTM5_CH_CTRL2_SR /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CH_CTRL2_SR*)0xF011314Cu)

/** \brief  13140, DTM Control Register */
#define GTM_DTM5_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_CTRL*)0xF0113140u)

/** \brief  13154, DTM Channel Dead Time Value Register */
#define GTM_DTM5_DTV_CH0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113154u)

/** Alias (User Manual Name) for GTM_DTM5_DTV_CH0.
* To use register names with standard convension, please use GTM_DTM5_DTV_CH0.
*/
#define	GTM_DTM5_CH0_DTV	(GTM_DTM5_DTV_CH0)

/** \brief  13158, DTM Channel Dead Time Value Register */
#define GTM_DTM5_DTV_CH1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113158u)

/** Alias (User Manual Name) for GTM_DTM5_DTV_CH1.
* To use register names with standard convension, please use GTM_DTM5_DTV_CH1.
*/
#define	GTM_DTM5_CH1_DTV	(GTM_DTM5_DTV_CH1)

/** \brief  1315C, DTM Channel Dead Time Value Register */
#define GTM_DTM5_DTV_CH2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF011315Cu)

/** Alias (User Manual Name) for GTM_DTM5_DTV_CH2.
* To use register names with standard convension, please use GTM_DTM5_DTV_CH2.
*/
#define	GTM_DTM5_CH2_DTV	(GTM_DTM5_DTV_CH2)

/** \brief  13160, DTM Channel Dead Time Value Register */
#define GTM_DTM5_DTV_CH3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_DTV_CH*)0xF0113160u)

/** Alias (User Manual Name) for GTM_DTM5_DTV_CH3.
* To use register names with standard convension, please use GTM_DTM5_DTV_CH3.
*/
#define	GTM_DTM5_CH3_DTV	(GTM_DTM5_DTV_CH3)

/** \brief  13150, DTM Phase Shift Control Register */
#define GTM_DTM5_PS_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_DTM_PS_CTRL*)0xF0113150u)

/** \brief  20, GTM Error Interrupt Enable Register */
#define GTM_EIRQ_EN /*lint --e(923)*/ (*(volatile Ifx_GTM_EIRQ_EN*)0xF0100020u)

/** \brief  24, GTM Hardware Configuration */
#define GTM_HW_CONF /*lint --e(923)*/ (*(volatile Ifx_GTM_HW_CONF*)0xF0100024u)

